// 这里存储所有的历史记录
const gameHistory = [

    // 示例数据
    { 
        id: "第000期", 
        seed: "CSGO-8888", 
        prize: "AWP | 二西莫夫 (久经沙场)", 
        players: ["玩家A", "玩家B", "玩家C", "玩家D", "玩家E"], 
        outSequence: [0, 1, 3, 4], 
        winnerIdx: 2, 
        date: "2023-11-25" 
    }, // <--- 注意这里！加了逗号，下面的数据才能生效
    
    // 第001期
    { 
        id: "第001期", 
        seed: "Internal_Random_3676", 
        prize: "Tec-9 | 遥控 (久经沙场)", 
        players: ["苏生1","苏生2","神之一偷","橙汁豹儿🍊","东方树叶🍃"], 
        outSequence: [1,2,3,0], 
        winnerIdx: 4, 
        date: "2025-11-24" 
    } // <--- 最后一个后面可以不加逗号，但加了也没事

];
